>\[*pandas*\] is derived from the term "**pan**el **da**ta", an econometrics term for data sets that include observations over multiple time periods for the same individuals.

* Built on top of Numpy used for fast analysis, data cleaning and preparation.

## Pandas Series

The primary two components of pandas are the `Series` and `DataFrame`. 

A `Series` is essentially a column, and a `DataFrame` is a multi-dimensional table made up of a collection of Series. 

Series + Series = DataFrame

In [3]:
#import necessary libraries

import pandas as pd
import numpy as np

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

** Using lists **

In [5]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

** Numpy arrays **

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

** Using dictionary **

In [10]:
#Using a dictionary will automatically take index value
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Using an Index

In [12]:
ser_1 = pd.Series(data = [10,20,30,40], index = ['USA','Germany','India','USSR'])

ser_1

USA        10
Germany    20
India      30
USSR       40
dtype: int64

In [13]:
ser_2 = pd.Series(data = [50,60,70,80], index = ['Germany','India','Aus','NZ'])

ser_2

Germany    50
India      60
Aus        70
NZ         80
dtype: int64

In [16]:
#To access a value call using respective index  
ser_1['USA']

10

In [17]:
#addition, matching index will get added
ser_1 + ser_2

Aus         NaN
Germany    70.0
India      90.0
NZ          NaN
USA         NaN
USSR        NaN
dtype: float64

## DataFrames

->  DataFrames are a bunch of Series objects put together to share the same index

In [41]:
from numpy.random import randn

In [43]:
#to get same set of random number
np.random.seed(100)

df1=pd.DataFrame(data = randn(5,4), index = 'A B C D E'.split() , columns= 'W X Y Z'.split())

df1

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

### Selection and Indexing

In [44]:
#To access W column
df1['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [45]:
#To access multiple columns
df1[['W','Z']]

          W         Z
A -1.749765 -0.252436
B  0.981321 -1.070043
C -0.189496  0.435163
D -0.583595 -0.104411
E -0.531280 -1.118318

DataFrame columns are just Series

In [46]:
type(df1['W'])

pandas.core.series.Series

#### Creating a new column

In [47]:
df1['new'] = df1['W'] + df1['Z']

df1

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -2.002202
B  0.981321  0.514219  0.221180 -1.070043 -0.088723
C -0.189496  0.255001 -0.458027  0.435163  0.245668
D -0.583595  0.816847  0.672721 -0.104411 -0.688006
E -0.531280  1.029733 -0.438136 -1.118318 -1.649599

** Removing columns **

In [52]:
df1.drop('new',axis=1)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [53]:
#Did not affect the original frame

df1

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -2.002202
B  0.981321  0.514219  0.221180 -1.070043 -0.088723
C -0.189496  0.255001 -0.458027  0.435163  0.245668
D -0.583595  0.816847  0.672721 -0.104411 -0.688006
E -0.531280  1.029733 -0.438136 -1.118318 -1.649599

In [54]:
#to effect the original frame

df1.drop('new', axis=1, inplace=True)

In [55]:
df1

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [56]:
#to drop row

df1.drop('E',axis=0)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [57]:
#Shape of a dataframe

df1.shape

(5, 4)

** Selecting rows **

In [58]:
df1.loc['A']

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

Or select based off of position instead of label

In [60]:
df1.iloc[2]

W   -0.189496
X    0.255001
Y   -0.458027
Z    0.435163
Name: C, dtype: float64

** Selecting rows and columns **

In [63]:
df1.loc['A','W']

-1.7497654730546974

In [64]:
df1.loc[['A','B'],['W','Z']]

          W         Z
A -1.749765 -0.252436
B  0.981321 -1.070043

In [65]:
df1.iloc[1,0]

0.9813207869512316

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [66]:
df1

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [67]:
df1>0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [68]:
#Values which are true are only returned

df1[df1>0]

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [72]:
df1[df1['X']>0]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [73]:
#Get boolean series where ['X'] > 0 , then returns 'Y' of that boolean series

df1[df1['X']>0]['Y']

A    1.153036
B    0.221180
C   -0.458027
D    0.672721
E   -0.438136
Name: Y, dtype: float64

In [76]:
#Get boolean series where ['W'] > 0 , then returns 'Y' & 'Z' of that boolean series

df1[df1['X']>0][['Y','Z']]

          Y         Z
A  1.153036 -0.252436
B  0.221180 -1.070043
C -0.458027  0.435163
D  0.672721 -0.104411
E -0.438136 -1.118318

In [81]:
df1[(df1['X']>0) & (df1['Y']>1)]

          W        X         Y         Z
A -1.749765  0.34268  1.153036 -0.252436

### More index details

In [83]:
df1

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [85]:
#Set inplace = True to change it permanently
df1.reset_index()

  index         W         X         Y         Z
0     A -1.749765  0.342680  1.153036 -0.252436
1     B  0.981321  0.514219  0.221180 -1.070043
2     C -0.189496  0.255001 -0.458027  0.435163
3     D -0.583595  0.816847  0.672721 -0.104411
4     E -0.531280  1.029733 -0.438136 -1.118318

In [87]:
states = 'PY TN KL AP TS'.split()

In [89]:
df1['States']=states

In [90]:
#set index

df1.set_index('States')

               W         X         Y         Z
States
PY     -1.749765  0.342680  1.153036 -0.252436
TN      0.981321  0.514219  0.221180 -1.070043
KL     -0.189496  0.255001 -0.458027  0.435163
AP     -0.583595  0.816847  0.672721 -0.104411
TS     -0.531280  1.029733 -0.438136 -1.118318

In [91]:
#Changes not affect the original frame
df1

          W         X         Y         Z States
A -1.749765  0.342680  1.153036 -0.252436     PY
B  0.981321  0.514219  0.221180 -1.070043     TN
C -0.189496  0.255001 -0.458027  0.435163     KL
D -0.583595  0.816847  0.672721 -0.104411     AP
E -0.531280  1.029733 -0.438136 -1.118318     TS

In [92]:
#Set inplace = True to effect in the dataframe

df1.set_index('States',inplace=True)

In [93]:
df1

               W         X         Y         Z
States
PY     -1.749765  0.342680  1.153036 -0.252436
TN      0.981321  0.514219  0.221180 -1.070043
KL     -0.189496  0.255001 -0.458027  0.435163
AP     -0.583595  0.816847  0.672721 -0.104411
TS     -0.531280  1.029733 -0.438136 -1.118318

### Multi-Index

In [114]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
multi_index = zip(outside,inside)

In [115]:
multi_index=pd.MultiIndex.from_tuples(multi_index)

multi_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [116]:
df2 = pd.DataFrame(randn(6,2), index=multi_index, columns='A B'.split())

In [117]:
df2

             A         B
G1 1 -0.862227  1.249470
   2 -0.079611 -0.889731
   3 -0.881798  0.018639
G2 1  0.237845  0.013549
   2 -1.635529 -1.044210
   3  0.613039  0.736205

In [118]:
df2.unstack()

           A                             B
           1         2         3         1         2         3
G1 -0.862227 -0.079611 -0.881798  1.249470 -0.889731  0.018639
G2  0.237845 -1.635529  0.613039  0.013549 -1.044210  0.736205

In [120]:
df2.stack().index

MultiIndex([('G1', 1, 'A'),
            ('G1', 1, 'B'),
            ('G1', 2, 'A'),
            ('G1', 2, 'B'),
            ('G1', 3, 'A'),
            ('G1', 3, 'B'),
            ('G2', 1, 'A'),
            ('G2', 1, 'B'),
            ('G2', 2, 'A'),
            ('G2', 2, 'B'),
            ('G2', 3, 'A'),
            ('G2', 3, 'B')],
           )

In [123]:
df2.loc['G1']

          A         B
1 -0.862227  1.249470
2 -0.079611 -0.889731
3 -0.881798  0.018639

In [124]:
df2.loc['G1'].loc[1]

A   -0.862227
B    1.249470
Name: 1, dtype: float64

In [126]:
#to get names of index

df2.index.names

FrozenList([None, None])

In [127]:
df2.index.names = ['Group','Num']

In [128]:
df2

                  A         B
Group Num
G1    1   -0.862227  1.249470
      2   -0.079611 -0.889731
      3   -0.881798  0.018639
G2    1    0.237845  0.013549
      2   -1.635529 -1.044210
      3    0.613039  0.736205

In [135]:
#Cross-section
df2.xs('G1')

            A         B
Num
1   -0.862227  1.249470
2   -0.079611 -0.889731
3   -0.881798  0.018639

In [133]:
df2.xs(['G1',1])

A   -0.862227
B    1.249470
Name: (G1, 1), dtype: float64

In [134]:
df2.xs(1,level='Num')

              A         B
Group
G1    -0.862227  1.249470
G2     0.237845  0.013549

### Missing Data

In [143]:
df3 = pd.DataFrame({'A':[1,np.nan,3],'B':[np.nan,np.nan,np.nan],'C':[7,8,9]})

df3

     A   B  C
0  1.0 NaN  7
1  NaN NaN  8
2  3.0 NaN  9

In [144]:
#drop rows with na values

df3.dropna()

Empty DataFrame
Columns: [A, B, C]
Index: []

In [146]:
#drop rows only if all values are null

df3.dropna(how='all', axis=1)

     A  C
0  1.0  7
1  NaN  8
2  3.0  9

In [148]:
#row 2 had two na values it will be dropped

df3.dropna(thresh=2)

     A   B  C
0  1.0 NaN  7
2  3.0 NaN  9

In [150]:
df3.fillna('NAN Value')

           A          B  C
0          1  NAN Value  7
1  NAN Value  NAN Value  8
2          3  NAN Value  9

In [153]:
df3['A'].fillna(df3['A'].mean())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

## Groupby

In [154]:
data = {'R1': ['A1', 'A1', 'B1', 'B1', 'C1', 'C1'],
        'R2': ['A', 'B', 'C', 'D', 'E', 'F'],
        'R3': [100,200,300,400,500,100] }

In [155]:
df4 = pd.DataFrame(data)

df4

   R1 R2   R3
0  A1  A  100
1  A1  B  200
2  B1  C  300
3  B1  D  400
4  C1  E  500
5  C1  F  100

In [157]:
df4.groupby('R1').mean()

     R3
R1
A1  150
B1  350
C1  300

In [162]:
#Can give aggregate functions
df4.groupby('R1').agg(['min','max','std','mean'])

     R3
    min  max         std mean
R1
A1  100  200   70.710678  150
B1  300  400   70.710678  350
C1  100  500  282.842712  300

In [161]:
df4.groupby('R1').describe()

      R3
   count   mean         std    min    25%    50%    75%    max
R1
A1   2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
B1   2.0  350.0   70.710678  300.0  325.0  350.0  375.0  400.0
C1   2.0  300.0  282.842712  100.0  200.0  300.0  400.0  500.0

### Concatenation

In [163]:
df5 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [165]:
df6 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [166]:
df7= pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [167]:
df5

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [168]:
df6

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [169]:
df7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [171]:
#Concat along rows
pd.concat([df5,df6,df7])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [172]:
pd.concat([df5,df6,df7],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [173]:
#Example dataframes
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [174]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [175]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

### Merge

In [176]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [178]:
#Some more complicated examples

In [182]:
left_ = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right_ = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [184]:
left_

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [185]:
right_

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [187]:
pd.merge(left_, right_, how='inner', on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [188]:
pd.merge(left_,right_, how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [189]:
pd.merge(left_,right_, how='left', on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [190]:
pd.merge(left_,right_, how='right', on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Joining

In [191]:
left__ = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right__ = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [192]:
left__

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [193]:
right__

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [194]:
pd.concat([left__,right__])

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K0  NaN  NaN   C0   D0
K2  NaN  NaN   C2   D2
K3  NaN  NaN   C3   D3

In [195]:
left__.join(right__)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [196]:
left__.join(right__,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations

In [198]:
df8 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df8

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Apply

In [201]:
df8['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [207]:
def add(x):
    return x+x

In [208]:
df8[['col1','col2']].apply(add)

   col1  col2
0     2   888
1     4  1110
2     6  1332
3     8   888

### Unique Values

In [217]:
#to get unique values in array
df8['col2'].unique()

array([444, 555, 666])

In [218]:
#no. of unique values
df8['col2'].nunique()

3

In [219]:
#Get how many times unique value occured in the column
df8['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [225]:
#sort values
df8.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Input and Output

#### CSV

In [226]:
#read csv
df_csv = pd.read_csv('example')

df_csv

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [227]:
#write csv
df_csv.to_csv('ex',index= False)

#### Excel file

In [234]:
#read excel

df_excel = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

df_excel

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [235]:
df_excel.to_excel('Excel_Sample.xlsx',sheet_name='Sheet2')